src/cfe/osn/InformationRegisters/Кт_ОбработкаЗаявкиНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Кт_ОбработкаЗаявкиНаДоставку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбработкаЗаказаКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ЗаявкаНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/InformationRegisters/Кт_ОбработкаЗаявкиНаДоставку/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда



#Область ОсновныеПроцедурыИФункции

Процедура УстановитьКлючОбработкиЗаказа( ЗаявкаНаДоставку ) Экспорт
	МенеджерЗаписи = РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заявка   				= ЗаявкаНаДоставку; 
	МенеджерЗаписи.ОбработкаЗаказаКлиента 	= Истина; 
	МенеджерЗаписи.Записать();    
КонецПроцедуры	

Функция ПолучитьКлючОбработкиЗаказа( ЗаявкаНаДоставку ) Экспорт
	Если ( ЗаявкаНаДоставку.Дата < Дата("20230504") ) Тогда
		Возврат ЗаявкаНаДоставку.ОбработкаЗаказаКлиента;
	КонецЕсли;	
	
    МенеджерЗаписи = РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заявка   	= ЗаявкаНаДоставку;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.ОбработкаЗаказаКлиента;
	КонецЕсли;   	
	Возврат Ложь;
КонецФункции	

Процедура УдалитьКлючОбработкиЗаказа( ЗаявкаНаДоставку ) Экспорт 
	НаборЗаписей = РегистрыСведений.Кт_ОбработкаЗаявкиНаДоставку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(ЗаявкаНаДоставку);
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецОбласти


#КонецЕсли
